<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Iris-Data" data-toc-modified-id="Iris-Data-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Iris Data</a></span><ul class="toc-item"><li><span><a href="#Use-the-function-defined-in-acquire.py-to-load-the-iris-data." data-toc-modified-id="Use-the-function-defined-in-acquire.py-to-load-the-iris-data.-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span><strong><font color="purple">Use the function defined in acquire.py to load the iris data.</font></strong></a></span></li><li><span><a href="#Drop-the-species_id-and-measurement_id-columns." data-toc-modified-id="Drop-the-species_id-and-measurement_id-columns.-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span><strong><font color="purple">Drop the species_id and measurement_id columns.</font></strong></a></span></li><li><span><a href="#Rename-the-species_name-column-to-just-species." data-toc-modified-id="Rename-the-species_name-column-to-just-species.-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span><strong><font color="purple">Rename the species_name column to just species.</font></strong></a></span></li><li><span><a href="#First,-I'm-going-to-split-my-data-into-train-and-test.-Why?-It's-good-to-split-your-data-before-processing-it-to-avoid-data-leakage!" data-toc-modified-id="First,-I'm-going-to-split-my-data-into-train-and-test.-Why?-It's-good-to-split-your-data-before-processing-it-to-avoid-data-leakage!-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span><strong><font color="red">First, I'm going to split my data into train and test. Why? It's good to split your data before processing it to avoid data leakage!</font></strong></a></span></li><li><span><a href="#Encode-the-species-name-using-a-sklearn-label-encoder." data-toc-modified-id="Encode-the-species-name-using-a-sklearn-label-encoder.-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span><strong><font color="purple">Encode the species name using a sklearn label encoder.</font></strong></a></span></li><li><span><a href="#Create-a-function-named-prep_iris-that-accepts-the-untransformed-iris-data,-and-returns-the-data-with-the-transformations-above-applied." data-toc-modified-id="Create-a-function-named-prep_iris-that-accepts-the-untransformed-iris-data,-and-returns-the-data-with-the-transformations-above-applied.-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span><strong><font color="purple">Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.</font></strong></a></span></li></ul></li><li><span><a href="#Titanic-Data" data-toc-modified-id="Titanic-Data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Titanic Data</a></span><ul class="toc-item"><li><span><a href="#Use-the-function-you-defined-in-acquire.py-to-load-the-titanic-data-set." data-toc-modified-id="Use-the-function-you-defined-in-acquire.py-to-load-the-titanic-data-set.-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span><strong><font color="purple">Use the function you defined in acquire.py to load the titanic data set.</font></strong></a></span></li><li><span><a href="#Remove-the-deck-column." data-toc-modified-id="Remove-the-deck-column.-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span><strong><font color="purple">Remove the deck column.</font></strong></a></span></li><li><span><a href="#First,-I'm-going-to-split-my-data-into-train-and-test." data-toc-modified-id="First,-I'm-going-to-split-my-data-into-train-and-test.-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span><strong><font color="red">First, I'm going to split my data into train and test.</font></strong></a></span></li><li><span><a href="#Handle-the-missing-values-in-the-embark_town-and-embarked-columns." data-toc-modified-id="Handle-the-missing-values-in-the-embark_town-and-embarked-columns.-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span><strong><font color="purple">Handle the missing values in the embark_town and embarked columns.</font></strong></a></span></li><li><span><a href="#Use-a-label-encoder-to-transform-the-embarked-column." data-toc-modified-id="Use-a-label-encoder-to-transform-the-embarked-column.-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span><strong><font color="purple">Use a label encoder to transform the embarked column.</font></strong></a></span></li><li><span><a href="#Scale-the-age-and-fare-columns-using-a-min-max-scaler.-Why-might-this-be-beneficial?-When-might-you-not-want-to-do-this?" data-toc-modified-id="Scale-the-age-and-fare-columns-using-a-min-max-scaler.-Why-might-this-be-beneficial?-When-might-you-not-want-to-do-this?-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span><strong><font color="purple">Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?</font></strong></a></span></li><li><span><a href="#Create-helper-functions-to-make-a-mother-function-named-prep_titanic-that-accepts-the-untransformed-titanic-data,-and-returns-the-data-with-the-transformations-above-applied." data-toc-modified-id="Create-helper-functions-to-make-a-mother-function-named-prep_titanic-that-accepts-the-untransformed-titanic-data,-and-returns-the-data-with-the-transformations-above-applied.-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span><strong><font color="purple">Create helper functions to make a mother function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.</font></strong></a></span></li></ul></li><li><span><a href="#Let's-Build-the-Mother-Function-from-Our-Helpers" data-toc-modified-id="Let's-Build-the-Mother-Function-from-Our-Helpers-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Let's Build the Mother Function from Our Helpers</a></span><ul class="toc-item"><li><span><a href="#Our-function-didn't-handle-the-missing-values-in-age.-We-could-impute-the-mean-or-median-age-for-men-women." data-toc-modified-id="Our-function-didn't-handle-the-missing-values-in-age.-We-could-impute-the-mean-or-median-age-for-men-women.-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Our function didn't handle the missing values in age. We could impute the mean or median age for men women.</a></span></li></ul></li></ul></div>

In [1]:
import pandas as pd
import numpy as np


import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler

# ignore warnings
import warnings
warnings.filterwarnings("ignore")

import acquire_walkthrough

## Iris Data

### **<font color=purple>Use the function defined in acquire.py to load the iris data.</font>**

In [2]:
iris_df = acquire_walkthrough.get_iris_data()
iris_df.head(3)

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2

### **<font color=purple>Drop the species_id and measurement_id columns.</font>**

**<font color=orange>I didn't specify 'measurement_id' in my SQL query in acquire, so I don't need to drop it. Depending on YOUR query, you may need to do that here or you can adjust your SQL query in acquire.</font>**

In [3]:
iris_df = iris_df.drop(columns='species_id')

In [4]:
iris_df.head(3)

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2

### **<font color=purple>Rename the species_name column to just species.</font>**

In [5]:
iris_df = iris_df.rename(columns={'species_name': 'species'})
iris_df.head(3)

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2

### **<font color=red>First, I'm going to split my data into train and test. Why? It's good to split your data before processing it to avoid data leakage!</font>**

**Want to know more about the importance of splitting first? Check out [this article](https://towardsdatascience.com/avoid-data-leakage-split-your-data-before-processing-a7f172632b00).**

In [6]:
train, test = train_test_split(iris_df, train_size=.75, stratify=iris_df.species, random_state=123)

In [7]:
train.shape

(112, 5)

In [8]:
test.shape

(38, 5)

### **<font color=purple>Encode the species name using a sklearn label encoder.</font>**

**Research the inverse_transform method of the label encoder. How might this be useful?**

In [9]:
le = LabelEncoder()

In [10]:
train['species'] = le.fit_transform(train.species)

In [11]:
test['species'] = le.transform(test.species)

In [12]:
train.head()

     species  sepal_length  sepal_width  petal_length  petal_width
30         0           4.8          3.1           1.6          0.2
36         0           5.5          3.5           1.3          0.2
29         0           4.7          3.2           1.6          0.2
55         1           5.7          2.8           4.5          1.3
118        2           7.7          2.6           6.9          2.3

In [13]:
test.head(1)

     species  sepal_length  sepal_width  petal_length  petal_width
135        2           7.7          3.0           6.1          2.3

### **<font color=purple>Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.</font>**

In [ ]:
def label_encode(train, test):
    le = LabelEncoder()
    train['species'] = le.fit_transform(train.species)
    test['species'] = le.transform(test.species)
    return le, train, test

In [ ]:
def prep_iris(df):
    df = df.drop(columns='species_id')
    df = df.rename(columns={'species_name': 'species'})
    train, test = train_test_split(df, train_size=.75, stratify=df.species, random_state=123)
    train, test, le = label_encode(train, test)
    return train, test, le

In [ ]:
#le, train, test = prep_iris(iris_df)

In [ ]:
#le

In [ ]:
#train.shape

In [ ]:
#test.shape

In [14]:
# Check our stratify on our target variable

train.species.value_counts(normalize=True)

0    0.339286
2    0.330357
1    0.330357
Name: species, dtype: float64

In [15]:
test.species.value_counts(normalize=True)

2    0.342105
1    0.342105
0    0.315789
Name: species, dtype: float64

**<font color=green>What if we want our species name back? Let's say we are done modeling, and we want to transform our encoded predictions back to easily understandable labels.</font>**

In [16]:
def inverse_encode(train, test, le):
    train['species'] = le.inverse_transform(train.species)
    test['species'] = le.inverse_transform(test.species)
    return train, test

In [17]:
train, test = inverse_encode(train, test, le)

In [18]:
train.head()

        species  sepal_length  sepal_width  petal_length  petal_width
30       setosa           4.8          3.1           1.6          0.2
36       setosa           5.5          3.5           1.3          0.2
29       setosa           4.7          3.2           1.6          0.2
55   versicolor           5.7          2.8           4.5          1.3
118   virginica           7.7          2.6           6.9          2.3

In [19]:
test.head(1)

       species  sepal_length  sepal_width  petal_length  petal_width
135  virginica           7.7          3.0           6.1          2.3

## Titanic Data

### **<font color=purple>Use the function you defined in acquire.py to load the titanic data set.</font>**

In [20]:
titanic_df = acquire_walkthrough.get_titanic_data()

In [21]:
titanic_df.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1

### **<font color=purple>Remove the deck column.</font>**

In [22]:
titanic_df.drop(columns=['deck'], inplace=True)

In [23]:
titanic_df.columns.tolist()

['passenger_id',
 'survived',
 'pclass',
 'sex',
 'age',
 'sibsp',
 'parch',
 'fare',
 'embarked',
 'class',
 'embark_town',
 'alone']

### **<font color=red>First, I'm going to split my data into train and test.</font>**

In [24]:
t_train, t_test = train_test_split(titanic_df, train_size=.75, stratify=titanic_df.survived, random_state=123)

In [25]:
t_train.shape

(668, 12)

In [26]:
t_test.shape

(223, 12)

### **<font color=purple>Handle the missing values in the embark_town and embarked columns.</font>**

**There are a couple of ways you can do this. I'll show you two.**

In [27]:
t_train.embark_town.value_counts(dropna=False)

Southampton    481
Cherbourg      133
Queenstown      53
NaN              1
Name: embark_town, dtype: int64

In [28]:
# fill nan values with the mode

t_train['embark_town'] = t_train['embark_town'].fillna('Southampton')

In [29]:
t_train.embark_town.value_counts(dropna=False)

Southampton    482
Cherbourg      133
Queenstown      53
Name: embark_town, dtype: int64

In [30]:
t_train.embarked.value_counts(dropna=False)

S      481
C      133
Q       53
NaN      1
Name: embarked, dtype: int64

In [31]:
t_train['embarked'] = t_train['embarked'].fillna('S')

In [32]:
t_train.embarked.value_counts(dropna=False)

S    482
C    133
Q     53
Name: embarked, dtype: int64

**<font color=orange>We can now do the same on test when we get to building our function.</font>**

### **<font color=purple>Use a label encoder to transform the embarked column.</font>**

One-Hot Encoding takes a column which has categorical data, which has been label encoded and then splits the column into multiple columns. The numbers are replaced by 1s and 0s, depending on which column has what value.

In [33]:
ohe = OneHotEncoder(sparse=False, categories='auto')
t_train_matrix = ohe.fit_transform(t_train[['embarked']])

In [34]:
# Create the array of values

t_train_matrix

array([[0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       ...,
       [0., 1., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [35]:
# Create the DataFrame of encoded values

t_train_ohe = pd.DataFrame(t_train_matrix, columns=ohe.categories_[0], index=t_train.index)
t_train_ohe.head(3)

       C    Q    S
683  0.0  0.0  1.0
421  0.0  1.0  0.0
336  0.0  0.0  1.0

In [36]:
# Join the encoded train DataFrame with our train DataFrame

t_train = t_train.join(t_train_ohe)
t_train.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,C,Q,S
683,683,0,3,male,14.0,5,2,46.9000,S,Third,Southampton,0,0.0,0.0,1.0
421,421,0,3,male,21.0,0,0,7.7333,Q,Third,Queenstown,1,0.0,1.0,0.0
336,336,0,1,male,29.0,1,0,66.6000,S,First,Southampton,0,0.0,0.0,1.0

In [ ]:
def ohe_columns(train, test):
    ohe = OneHotEncoder(sparse=False, categories='auto')
    train_matrix = ohe.fit_transform(train[['embarked']])
    test_matrix = ohe.transform(test[['embarked']])
    train = pd.DataFrame(train_matrix, columns=ohe.categories_[0], index=train.index)
    test = pd.DataFrame(test_matrix, columns=ohe.categories_[0], index=test.index)
    return ohe, train, test

**<font color=orange>We can now do the same on test when we get to building our function.</font>**

### **<font color=purple>Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?</font>**

**<font color=red>You wouldn't want to scale these columns when you're exploring the data or trying to explain the data to others. The Scaled data can be very confusing in explanatory charts.</font>**

In [37]:
scaler = MinMaxScaler()

In [38]:
t_train[['age','fare']] = scaler.fit_transform(t_train[['age','fare']])

In [45]:
t_train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,C,Q,S
683,683,0,3,male,0.184561,5,2,0.091543,S,Third,Southampton,0,0.0,0.0,1.0
421,421,0,3,male,0.279696,0,0,0.015094,Q,Third,Queenstown,1,0.0,1.0,0.0
336,336,0,1,male,0.388421,1,0,0.129995,S,First,Southampton,0,0.0,0.0,1.0
681,681,1,1,male,0.361239,0,0,0.149765,C,First,Cherbourg,1,1.0,0.0,0.0
610,610,0,3,female,0.524327,1,5,0.061045,S,Third,Southampton,0,0.0,0.0,1.0

### **<font color=purple>Create helper functions to make a mother function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.</font>**

In [ ]:
#titanic_df = acquire_walkthrough.get_titanic_data()

In [ ]:
#titanic_df.head()

In [ ]:
def drop_columns(df):
    df.drop(columns=['deck'], inplace=True)
    return df

In [ ]:
#df = drop_columns(titanic_df)
#df.head()

In [ ]:
train, test = train_test_split(titanic_df, train_size=.75, stratify=titanic_df.survived, random_state=123)

In [ ]:
def impute_embark_town(train, test):
    train['embark_town'] = train['embark_town'].fillna('Southampton')
    test['embark_town'] = test['embark_town'].fillna('Southampton')
    return train, test

In [ ]:
#train, test = train_test_split(df, train_size=.75, stratify=titanic_df.survived, random_state=123)

In [ ]:
#train.shape

In [ ]:
#test.shape

In [ ]:
#train, test = impute_embark_town(train, test)

In [ ]:
#train.embark_town.value_counts(dropna=False)

In [ ]:
def impute_embarked(train, test):
    train['embarked'] = train['embarked'].fillna('S')
    test['embarked'] = test['embarked'].fillna('S')
    return train, test

In [ ]:
#train, test = impute_embarked(train, test)

In [ ]:
#train.embarked.value_counts(dropna=False)

**<font color=red>I added this function after I got to the end and realized that I had not handled all the Null Values in age.<>**

In [ ]:
def impute_age(train, test):
    avg_age = train.age.mean()
    train.age = train.age.fillna(avg_age)
    test.age = test.age.fillna(avg_age)
    return train, test

In [ ]:
#train, test = impute_age(train, test)

In [ ]:
#train.head()

In [ ]:
#train.age.value_counts(dropna=False)

In [ ]:
def scale_columns(train, test):
    scaler = MinMaxScaler()
    train[['age','fare']] = scaler.fit_transform(train[['age','fare']])
    test[['age','fare']] = scaler.transform(test[['age','fare']])
    return scaler, train, test

In [ ]:
#scaler, train, test = scale_columns(train, test)

In [ ]:
#scaler

In [ ]:
#train.head(1)

In [ ]:
def ohe_columns(train, test):
    # create encoder
    ohe = OneHotEncoder(sparse=False, categories='auto')
    
    # fit scaler on train and transform train and test to dense matrices
    train_matrix = ohe.fit_transform(train[['embarked']])
    test_matrix = ohe.transform(test[['embarked']])
    
    # transform matrices to DataFrames
    train_ohe = pd.DataFrame(train_matrix, columns=ohe.categories_[0], index=train.index)
    test_ohe = pd.DataFrame(test_matrix, columns=ohe.categories_[0], index=test.index)
    
    # join encoded matrix with original train or test matrices
    train = train.join(train_ohe)
    test = test.join(test_ohe)
    
    return ohe, train, test

In [ ]:
#ohe, train, test = ohe_columns(train, test)

In [ ]:
#train.head()

## Let's Build the Mother Function from Our Helpers

In [ ]:
def prep_titanic(df):
    # drop the deck column bc most values Null
    drop_columns(df)
    
    train, test = train_test_split(df, train_size=.75, stratify=titanic_df.survived, random_state=123)
    
    # impute 2 NaNs in embark_town with most frequent value
    train, test = impute_embark_town(train, test)
    
    # impute 2 NaNs in embarked with most frequent value
    train, test = impute_embarked(train, test)
    
    # impute NaNs in age in train and test with the mean age in train
    train, test = impute_age(train, test)
    
    # use a minmax scaler on age and fare bc of differing measurement units
    scaler, train, test = scale_columns(train, test)
    
    # ohe embarked creating three new columns for C, Q, S representing embark towns
    ohe, train, test = ohe_columns(train, test)
    
    return scaler, ohe, train, test

In [ ]:
#scaler, ohe, train, test = prep_titanic(titanic_df)

In [ ]:
#scaler

In [ ]:
#ohe

In [ ]:
#train.head()

In [ ]:
#test.head()

In [41]:
# Check stratify

t_train.survived.value_counts(normalize=True)

0    0.616766
1    0.383234
Name: survived, dtype: float64

In [42]:
t_test.survived.value_counts(normalize=True)

0    0.61435
1    0.38565
Name: survived, dtype: float64

In [43]:
t_train.isna().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             131
sibsp             0
parch             0
fare              0
embarked          0
class             0
embark_town       0
alone             0
C                 0
Q                 0
S                 0
dtype: int64

In [47]:
t_test.isna().sum()

passenger_id     0
survived         0
pclass           0
sex              0
age             46
sibsp            0
parch            0
fare             0
embarked         1
class            0
embark_town      1
alone            0
dtype: int64

### Our function didn't handle the missing values in age. We could impute the mean or median age for men women.

**<font color=red>This prompted me to build a function to impute age above. My prep_titanic function will handle the missing values in age.<font>**